src/Documents/ИнвентаризацияАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИнвентаризацияАлкогольнойПродукцииЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки1ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Comment>Фактическое количество товаров на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКнижн</Name>
							<Comment>Расчетное (по базе данных) количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрихкод</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАлкогольнойПродукцииЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРегистра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/АктСписанияЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктСписанияЕГАИС</Name>
			<BasedOn>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ИнвентаризацияАлкогольнойПродукцииЕГАИС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМарокЕГАИС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер акта постановки на баланс</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоНакладной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничная</Name>
							<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРозничная</Name>
							<Comment>Розничная сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИнвентаризацияАлкогольнойПродукцииЕГАИС/Ext/ManagerModule.bsl
// Модуль менеджера документа "Инвентаризация алкогольной продукции ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

Функция РассчитатьКоличествоКнижное(Объект, НаДатуДокумента = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		ВывестиСообщение(НСтр("ru='Не выбрана организация ЕГАИС.'"));
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим дубли и заполним количество книжн
	Ошибки = "";
	СписокНайденныхДублей = Новый СписокЗначений();
	// идем по табличной части
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.АлкогольнаяПродукция) Тогда 
			Продолжить; // пустые при определении дублей не берём во внимание, т.к. по ним остатка в ЕГАИС быть не может
		КонецЕсли;
		
		// создадим структуру отбора для проверки уникальности алкопродукции
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("АлкогольнаяПродукция", СтрокаТаблицы.АлкогольнаяПродукция);
		СтруктураОтбора.Вставить("Справка2",             СтрокаТаблицы.Справка2);
		
		// проверка уникальности
		Если СписокНайденныхДублей.НайтиПоЗначению(СтрокаТаблицы) = Неопределено Тогда
			// поищем строки удовлетворяющие структуре отбора
			НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураОтбора);
			// если нашли и их больше 1, то строки не уникальные
			Если НайденныеСтроки.Количество()>1 Тогда
				// добавим строку в список найденных дублей, что бы не сообщать о ней еще раз
				ДублирующиесяСтроки = ""; 
				//дополним строку сообщения...
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
					ДублирующиесяСтроки = ДублирующиесяСтроки+"," + СокрЛП(НайденнаяСтрока.НомерСтроки);
					// добавим строку в список найденных дублей, чтобы не сообщать о ней еще раз
					СписокНайденныхДублей.Добавить(НайденнаяСтрока);
				КонецЦикла;
				Ошибки = Ошибки + НСтр("ru = 'Таблица ""Товары"": значения колонок ""Алкогольная продукция и Справка 2"" не уникальны ! Строки:'")+ " " +Сред(ДублирующиесяСтроки,2)+Символы.ПС;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ошибки <> "" Тогда	
		ВывестиСообщение(НСтр("ru = 'В документе найдены дубли алкогольной продукции! Выполните сначала свёртку одинаковых строк!'") + Символы.ПС + Ошибки);
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ТабличнаяЧастьТовары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка",               Объект.Ссылка);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВложеннаяТаблица.ДокументОснования КАК ДокументОснования
	|ПОМЕСТИТЬ
	|	ТаблицаОснований
	|ИЗ
	|	(ВЫБРАТЬ
	|		АктСписанияЕГАИС.Ссылка КАК ДокументОснования
	|	ИЗ
	|		Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
	|	ГДЕ
	|		АктСписанияЕГАИС.ДокументОснование = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АктПостановкиНаБалансЕГАИС.Ссылка
	|	ИЗ
	|		Документ.АктПостановкиНаБалансЕГАИС КАК АктПостановкиНаБалансЕГАИС
	|	ГДЕ
	|		АктПостановкиНаБалансЕГАИС.ДокументОснование = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПеремещениеВТорговыйЗалЕГАИС.Ссылка
	|	ИЗ
	|		Документ.ПеремещениеВТорговыйЗалЕГАИС КАК ПеремещениеВТорговыйЗалЕГАИС
	|	ГДЕ
	|		ПеремещениеВТорговыйЗалЕГАИС.ДокументОснование = &Ссылка) КАК ВложеннаяТаблица
	|;
	|
	|ВЫБРАТЬ
	|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2 КАК Справка2,
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ОстаткиАлкогольнойПродукцииЕГАИС.Количество
	|		ИНАЧЕ
	|			-ОстаткиАлкогольнойПродукцииЕГАИС.Количество
	|	КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаКорректировки
	|ИЗ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|ГДЕ
	|	ОстаткиАлкогольнойПродукцииЕГАИС.Регистратор В (ВЫБРАТЬ ДокументОснования ИЗ ТаблицаОснований)
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2,
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция
	|ИМЕЮЩИЕ
	|	(НЕ СУММА(ВЫБОР
	|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ОстаткиАлкогольнойПродукцииЕГАИС.Количество
	|		ИНАЧЕ
	|			-ОстаткиАлкогольнойПродукцииЕГАИС.Количество
	|	КОНЕЦ) = 0)
	|;
	|";
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияВТорговомЗалеЕГАИС Тогда
		Запрос.Текст = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) КАК Справка2,
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ТабличнаяЧастьТовары.НомерСтроки-1 КАК ИндексСтроки
		|ПОМЕСТИТЬ
		|	ТабличнаяЧастьТовары
		|ИЗ
		|	&ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|;
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьТовары.ИндексСтроки КАК ИндексСтроки,
		|	ВЫБОР
		|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА
		|			0
		|		ИНАЧЕ
		|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция.Упакована ТОГДА
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		ИНАЧЕ
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток*10
		|	КОНЕЦ+ЕСТЬNULL(ТаблицаКорректировки.Количество, 0) КАК КоличествоОстаток
		|ИЗ
		|	ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			"+?(НаДатуДокумента, "&Момент", "")+",
		|			(ОрганизацияЕГАИС, Справка2, АлкогольнаяПродукция) В (ВЫБРАТЬ ОрганизацияЕГАИС, Справка2, АлкогольнаяПродукция ИЗ ТабличнаяЧастьТовары)) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|ПО
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаКорректировки КАК ТаблицаКорректировки
		|ПО
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция = ТаблицаКорректировки.АлкогольнаяПродукция И 
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2             = ТаблицаКорректировки.Справка2
		|";
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияЕГАИС Тогда
		Запрос.Текст = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	ТабличнаяЧастьТовары.Справка2 КАК Справка2,
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ТабличнаяЧастьТовары.НомерСтроки-1 КАК ИндексСтроки
		|ПОМЕСТИТЬ
		|	ТабличнаяЧастьТовары
		|ИЗ
		|	&ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|;
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьТовары.ИндексСтроки КАК ИндексСтроки,
		|	ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток, 0)+ЕСТЬNULL(ТаблицаКорректировки.Количество, 0) КАК КоличествоОстаток
		|ИЗ
		|	ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			"+?(НаДатуДокумента, "&Момент", "")+",
		|			(ОрганизацияЕГАИС, Справка2, АлкогольнаяПродукция) В (ВЫБРАТЬ ОрганизацияЕГАИС, Справка2, АлкогольнаяПродукция ИЗ ТабличнаяЧастьТовары)) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|ПО
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция И 
		|	ТабличнаяЧастьТовары.Справка2 = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаКорректировки КАК ТаблицаКорректировки
		|ПО
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция = ТаблицаКорректировки.АлкогольнаяПродукция И 
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2             = ТаблицаКорректировки.Справка2
		|";
	Иначе
		Запрос.Текст = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	ТабличнаяЧастьТовары.Справка2 КАК Справка2,
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ТабличнаяЧастьТовары.НомерСтроки-1 КАК ИндексСтроки
		|ПОМЕСТИТЬ
		|	ТабличнаяЧастьТовары
		|ИЗ
		|	&ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|;
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьТовары.ИндексСтроки КАК ИндексСтроки,
		|	ВЫБОР
		|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА
		|			0
		|		ИНАЧЕ
		|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция.Упакована ТОГДА
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		ИНАЧЕ
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток*10
		|	КОНЕЦ+ЕСТЬNULL(ТаблицаКорректировки.Количество, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ТаблицаКорректировки.Количество, 0) КАК КоличествоКор
		|ИЗ
		|	ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			"+?(НаДатуДокумента, "&Момент", "")+",
		|			(ОрганизацияЕГАИС, Справка2, АлкогольнаяПродукция) В (ВЫБРАТЬ ОрганизацияЕГАИС, Справка2, АлкогольнаяПродукция ИЗ ТабличнаяЧастьТовары)) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|ПО
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция И 
		|	ТабличнаяЧастьТовары.Справка2 = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаКорректировки КАК ТаблицаКорректировки
		|ПО
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция = ТаблицаКорректировки.АлкогольнаяПродукция И 
		|	ТабличнаяЧастьТовары.Справка2             = ТаблицаКорректировки.Справка2
		|";
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТовара = Объект.Товары[Выборка.ИндексСтроки];
		СтрокаТовара.КоличествоКнижн = Выборка.КоличествоОстаток;
		Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоКнижнПриИзменении(Объект, СтрокаТовара);
	КонецЦикла;
	
	// Обновим служебные реквизиты Алкогольной продукции
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
	
	Возврат Истина;
	
КонецФункции // РассчитатьИтогиОперации()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("ОрганизацияЕГАИС");
	
	ОбязательныеРеквизиты.Добавить("Товары.АлкогольнаяПродукция");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары=Новый Массив();
	УникальныеТовары.Добавить("АлкогольнаяПродукция");
	Если НЕ Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияВТорговомЗалеЕГАИС Тогда
		УникальныеТовары.Добавить("Справка2");
	КонецЕсли;
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "ОрганизацияЕГАИС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияЕГАИСПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	РассчитатьКоличествоКнижное(Объект);
	
КонецПроцедуры // ОрганизацияЕГАИСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	РассчитатьКоличествоКнижное(Объект);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.АлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия);
	
	КоличествоКнижн = 0;
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияВТорговомЗалеЕГАИС И ЗначениеЗаполнено(Строка.АлкогольнаяПродукция) И ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА
		|			0
		|		ИНАЧЕ
		|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция.Упакована ТОГДА
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		ИНАЧЕ
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток*10
		|	КОНЕЦ КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			&Момент,
		|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС
		|				И АлкогольнаяПродукция = &АлкогольнаяПродукция
		|				И Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки";
		
		Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
		Запрос.УстановитьПараметр("АлкогольнаяПродукция", Строка.АлкогольнаяПродукция);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоКнижн = Выборка.КоличествоОстаток;
		КонецЕсли;
		
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияЕГАИС И ЗначениеЗаполнено(Строка.АлкогольнаяПродукция) И ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		
		Если ЗначениеЗаполнено(Строка.Справка2) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
			|			&Момент,
			|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС
			|				И АлкогольнаяПродукция = &АлкогольнаяПродукция
			|				И Справка2 = &Справка2) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
			|";
			Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
			Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
			Запрос.УстановитьПараметр("АлкогольнаяПродукция", Строка.АлкогольнаяПродукция);
			Запрос.УстановитьПараметр("Справка2",             Строка.Справка2);
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаОстаткиАП = РезультатЗапроса.Выбрать();
			
			Если ВыборкаОстаткиАП.Следующий() Тогда
				КоличествоКнижн = ВыборкаОстаткиАП.КоличествоОстаток;
			КонецЕсли;
		Иначе
			КоличествоКнижн = 0;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Строка.АлкогольнаяПродукция) И ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			&Момент,
		|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС
		|				И АлкогольнаяПродукция = &АлкогольнаяПродукция
		|				И Справка2 = &Справка2) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|";
		Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
		Запрос.УстановитьПараметр("АлкогольнаяПродукция", Строка.АлкогольнаяПродукция);
		Запрос.УстановитьПараметр("Справка2",             Строка.Справка2);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаОстаткиАП = РезультатЗапроса.Выбрать();
		
		Если ВыборкаОстаткиАП.Следующий() Тогда
			КоличествоКнижн = ВыборкаОстаткиАП.КоличествоОстаток;
		КонецЕсли;
		
	КонецЕсли;
	
	Строка.КоличествоКнижн = КоличествоКнижн;
	ТоварыКоличествоКнижнПриИзменении(Объект, Строка, ПараметрыДействия);
	
	НеОбновлятьДанныеПоАлкоголю = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НеОбновлятьДанныеПоАлкоголю", Ложь);
	
	// Обновим служебные реквизиты Алкогольной продукции
	Если Не НеОбновлятьДанныеПоАлкоголю Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
	КонецЕсли;
	
КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Справка2" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыСправка2ПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.АлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия);
	
	Если ЕстьРеквизит(Объект, "Грузополучатель", "Товары") Тогда
		Строка.Грузополучатель = Строка.Справка2.Грузополучатель;
	КонецЕсли;
	
	// Получим количество книжн
	КоличествоКнижн = 0;
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияЕГАИС И ЗначениеЗаполнено(Строка.АлкогольнаяПродукция) И ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		
		Если ЗначениеЗаполнено(Строка.Справка2) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
			|			&Момент,
			|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС
			|				И АлкогольнаяПродукция = &АлкогольнаяПродукция
			|				И Справка2 = &Справка2) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
			|";
			Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
			Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
			Запрос.УстановитьПараметр("АлкогольнаяПродукция", Строка.АлкогольнаяПродукция);
			Запрос.УстановитьПараметр("Справка2",             Строка.Справка2);
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаОстаткиАП = РезультатЗапроса.Выбрать();
			
			Если ВыборкаОстаткиАП.Следующий() Тогда
				КоличествоКнижн = ВыборкаОстаткиАП.КоличествоОстаток;
			КонецЕсли;
		Иначе
			КоличествоКнижн = 0;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Строка.АлкогольнаяПродукция) И ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			&Момент,
		|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС
		|				И АлкогольнаяПродукция = &АлкогольнаяПродукция
		|				И Справка2 = &Справка2) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|";
		Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
		Запрос.УстановитьПараметр("АлкогольнаяПродукция", Строка.АлкогольнаяПродукция);
		Запрос.УстановитьПараметр("Справка2",             Строка.Справка2);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаОстаткиАП = РезультатЗапроса.Выбрать();
		
		Если ВыборкаОстаткиАП.Следующий() Тогда
			КоличествоКнижн = ВыборкаОстаткиАП.КоличествоОстаток;
		КонецЕсли;
		
	КонецЕсли;
	
	Строка.КоличествоКнижн = КоличествоКнижн;
	ТоварыКоличествоКнижнПриИзменении(Объект, Строка, ПараметрыДействия);
	
	НеОбновлятьДанныеПоАлкоголю = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НеОбновлятьДанныеПоАлкоголю", Ложь);
	
	// Обновим служебные реквизиты Алкогольной продукции
	Если Не НеОбновлятьДанныеПоАлкоголю Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект,Объект.Товары, Объект.Марки);
	КонецЕсли;
	
КонецПроцедуры // ТоварыСправка2ПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	//Строка.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Строка.Номенклатура);
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеЕдиницаИзмерения(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоФактПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	Если Не ЕстьРеквизит(Объект, "Количество", "Товары") Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Количество = Строка.КоличествоФакт - Строка.КоличествоКнижн;
	
КонецПроцедуры // ТоварыКоличествоФактПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоКнижнПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	Если Не ЕстьРеквизит(Объект, "Количество", "Товары") Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Количество = Строка.КоличествоФакт - Строка.КоличествоКнижн;
	
КонецПроцедуры // ТоварыКоличествоКнижнПриИзменении)

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "Марки"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // МаркиКодМаркиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьКоличествоКнижн",, "Товары", НСтр("ru = 'Заполнить книжное количество'"), ПараметрыКоманды,,,,Ложь);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыОчиститьКоличествоКнижн",, "Товары", НСтр("ru = 'Очистить книжное количество'"), ПараметрыКоманды,,,,Ложь, Истина);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыСвернутьОдинаковыеСтроки",, "Товары", НСтр("ru = 'Свернуть одинаковые строки'"), ПараметрыКоманды,,,,Ложь, Истина);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ДополнитьКнижнымиЗапасами",, "Товары", НСтр("ru = 'Дополнить книжными данными'"), ПараметрыКоманды,,,,Ложь,Ложь);
	
	ПараметрыКоманды = Новый Структура();
	ПараметрыФормы = Новый Структура("МножественныйВыбор, РежимВыбора", Истина, Истина);
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаВидаАП", "Справочник.ВидыАлкогольнойПродукции.Форма.ФормаВыбораГруппы",ПараметрыФормы,, Истина, НСтр("ru = 'Необходимо выбрать группу вида алкогольной продукции.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ДополнитьКнижнымиЗапасамиПоГруппе", "ДополнитьКнижнымиЗапасами", "Товары", НСтр("ru = 'Дополнить книжными данными по группе вида алкогольной продукции'"), ПараметрыКоманды,,,,Ложь,Ложь);
	
	ПараметрыКоманды = Новый Структура();
	ПараметрыФормы = Новый Структура("МножественныйВыбор, РежимВыбора", Истина, Истина);
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ИнвентаризацияАП_ЕГАИС", "Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Форма.ФормаСписка",ПараметрыФормы,, Истина, НСтр("ru = 'Необходимо выбрать документы.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ДополнитьИнвентаризациейЕГАИС", "ДополнитьИнвентаризациейЕГАИС", "Товары", НСтр("ru = 'Дополнить по инвентаризации алкогольной продукции ЕГАИС'"), ПараметрыКоманды,,,,Ложь,Ложь);
	
	ПараметрыКоманды = Новый Структура();
	
	ПараметрыОперации = ПоследовательныеОперации.СоздатьПараметрыОперацииВводДаты();
	ПараметрыОперации.ВводДаты         = НСтр("ru = 'Конечная дата'");
	ПараметрыОперации.Дата             = ТекущаяДата();
	ПараметрыОперации.Обязательный     = Ложь;
	ПараметрыОперации.ЧастьДаты        = ЧастиДаты.ДатаВремя;
	//ПараметрыОперации.Пропустить       = Истина;
	ПараметрыОперации.ТекстОтменыВвода = НСтр("ru = 'Будет выбрана текущая дата'");
	
	ПараметрыКоманды.Вставить("КонечнаяДата", ПараметрыОперации);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ВыполнитьКорректировкиПоДаннымПродажИПоставок",, "Товары", НСтр("ru = 'Выполнить корректировки по данным продаж и поставок'"), ПараметрыКоманды,,,,Ложь,Ложь);
	
	ПараметрыКоманды = Новый Структура();
	
	ПараметрыОперации = ПоследовательныеОперации.СоздатьПараметрыОперацииВводДаты();
	ПараметрыОперации.ВводДаты         = НСтр("ru = 'Конечная дата'");
	ПараметрыОперации.Дата             = ТекущаяДата();
	ПараметрыОперации.Обязательный     = Ложь;
	ПараметрыОперации.ЧастьДаты        = ЧастиДаты.ДатаВремя;
	//ПараметрыОперации.Пропустить       = Истина;
	ПараметрыОперации.ТекстОтменыВвода = НСтр("ru = 'Будет выбрана текущая дата'");
	
	ПараметрыКоманды.Вставить("КонечнаяДата", ПараметрыОперации);
	ПараметрыФормы = Новый Структура("МножественныйВыбор, РежимВыбора", Истина, Истина);
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаВидаАП", "Справочник.ВидыАлкогольнойПродукции.Форма.ФормаВыбораГруппы",ПараметрыФормы,, Истина, НСтр("ru = 'Необходимо выбрать группу вида алкогольной продукции.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ВыполнитьКорректировкиПоДаннымПродажИПоставокПоГруппе", "ВыполнитьКорректировкиПоДаннымПродажИПоставок", "Товары", НСтр("ru = 'Выполнить корректировки по данным продаж и поставок по группе вида алкогольной продукции'"), ПараметрыКоманды,,,,Ложь,Ложь);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ПараметрыКоманд = Новый Соответствие;
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияВТорговомЗалеЕГАИС Тогда
		ПараметрыКоманд.Вставить("ВыполнитьКорректировкиПоДаннымПродажИПоставок.Видимость",  Ложь);
		ПараметрыКоманд.Вставить("ВыполнитьКорректировкиПоДаннымПродажИПоставокПоГруппе.Видимость", Ложь);
	Иначе
		ПараметрыКоманд.Вставить("ВыполнитьКорректировкиПоДаннымПродажИПоставок.Видимость",  Истина);
		ПараметрыКоманд.Вставить("ВыполнитьКорректировкиПоДаннымПродажИПоставокПоГруппе.Видимость", Истина);
	КонецЕсли;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()

// Обработчик заполнения книжного количества из остатков
//
Функция ТоварыЗаполнитьКоличествоКнижн(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	РассчитатьКоличествоКнижное(Объект);
	
КонецФункции // ТоварыЗаполнитьКоличествоКнижн()

// Обработчик очистки книжного количества
//
Функция ТоварыОчиститьКоличествоКнижн(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Для Каждого СтрокаТовара из Объект.Товары Цикл
		СтрокаТовара.КоличествоКнижн = 0;
		Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоКнижнПриИзменении(Объект, СтрокаТовара, ПараметрыДействия);
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьКоличествоКнижн()

// Обработчик заполнения книжного количества из отстков
//
Функция ТоварыСвернутьОдинаковыеСтроки(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ИнвентаризацияВТорговомЗалеЕГАИС = Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияВТорговомЗалеЕГАИС;
	
	Товары = Объект.Товары.Выгрузить();
	Если ИнвентаризацияВТорговомЗалеЕГАИС Тогда
		
		ПоляПоиска = "Номенклатура, ШтрихКод, АлкогольнаяПродукция";
		
		
		Товары.Свернуть(ПоляПоиска, "КоличествоФакт");
		//Объект.Товары.Загрузить(Товары);
		
	Иначе
		
		ПоляПоиска = "Номенклатура,ШтрихКод, Справка1, Справка2, АлкогольнаяПродукция";
		
		//Товары = Объект.Товары;
		
		СтруктураПоиска = Новый Структура(ПоляПоиска);
		
		УникальныеПозиции = Объект.Товары.Выгрузить(, ПоляПоиска);
		УникальныеПозиции.Свернуть(ПоляПоиска);
		
		Для Каждого ТоварнаяСтрока Из УникальныеПозиции Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТоварнаяСтрока);
			ОдинаковыеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
			ИдентификаторСтроки = Новый УникальныйИдентификатор;
			Для Каждого ТекущаяСтрока Из ОдинаковыеСтроки Цикл
				НайденныеМарки = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
				Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
					ТекущаяМарка.ИдентификаторСтроки = ИдентификаторСтроки;
				КонецЦикла;
				ТекущаяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			КонецЦикла;
		КонецЦикла;
		
		ПоляПоиска = ПоляПоиска + ",ИдентификаторСтроки";
		Товары.Свернуть(ПоляПоиска, "КоличествоФакт");
	КонецЕсли;
	
	Объект.Товары.Загрузить(Товары);
	
	Для Каждого СтрокаТовара из Объект.Товары Цикл
		Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоФактПриИзменении(Объект, СтрокаТовара, ПараметрыДействия);
	КонецЦикла;
	
	//пересчитывать нужно разом, поскольку могут быть дубли строк из-за производителя.
	РассчитатьКоличествоКнижное(Объект);
	
КонецФункции // ТоварыСвернутьОдинаковыеСтроки()

Функция ДополнитьКнижнымиЗапасами(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено, НаДатуДокумента = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		ВывестиСообщение(НСтр("ru='Не выбрана организация ЕГАИС.'"));
		Возврат Истина;
	КонецЕсли;
	
	ГруппаВидаАП = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "ГруппаВидаАП", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент",               ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), Объект.Дата));
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Объект.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ТабличнаяЧастьТовары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ГруппаВидаАП",         ГруппаВидаАП);
	Запрос.УстановитьПараметр("Ссылка",               Объект.Ссылка);
	
	ИнвентаризацияВТорговомЗалеЕГАИС = (Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияВТорговомЗалеЕГАИС);
	Если ИнвентаризацияВТорговомЗалеЕГАИС Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|ПОМЕСТИТЬ
		|	ТабличнаяЧастьТовары
		|ИЗ
		|	&ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|;
		|
		|ВЫБРАТЬ
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток КАК КоличествоОстаток
		//|	ВЫБОР
		//|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция.Упакована ТОГДА
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток
		//|		ИНАЧЕ
		//|			ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток*10
		//|	КОНЕЦ КАК КоличествоОстаток
		|ПОМЕСТИТЬ
		|	ОстаткиАлкогольнойПродукции
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			"+?(НаДатуДокумента, "&Момент", "")+"," + ?(ГруппаВидаАП = Неопределено, "", "
		|			АлкогольнаяПродукция.ВидПродукции В ИЕРАРХИИ (&ГруппаВидаАП) И ")+"
		|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС И Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|ПО
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция
		|ГДЕ
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция ЕСТЬ NULL
		|;
		|
		|ВЫБРАТЬ
		|	ОстаткиАлкогольнойПродукции.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	МАКСИМУМ(ОстаткиАлкогольнойПродукции.КоличествоОстаток) КАК КоличествоОстаток,
		|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
		|ИЗ
		|	ОстаткиАлкогольнойПродукции КАК ОстаткиАлкогольнойПродукции
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|ПО
		|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукции.АлкогольнаяПродукция
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура.КоличествоВМультипаке = 1 ИЛИ 
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура.КоличествоВМультипаке = 0
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАлкогольнойПродукции.АлкогольнаяПродукция
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТовара = Объект.Товары.Добавить();
			СтрокаТовара.Номенклатура         = Выборка.Номенклатура;
			Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыНоменклатураПриИзменении(Объект, СтрокаТовара);
			СтрокаТовара.АлкогольнаяПродукция = Выборка.АлкогольнаяПродукция;
			СтрокаТовара.КоличествоКнижн      = Выборка.КоличествоОстаток;
			Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоКнижнПриИзменении(Объект, СтрокаТовара);
			СтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЦикла;
		
	Иначе
		
		ИнвентаризацияЕГАИС = (Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияЕГАИС);
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВложеннаяТаблица.ДокументОснования КАК ДокументОснования
		|ПОМЕСТИТЬ
		|	ТаблицаОснований
		|ИЗ
		|	(ВЫБРАТЬ
		|		АктСписанияЕГАИС.Ссылка КАК ДокументОснования
		|	ИЗ
		|		Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
		|	ГДЕ
		|		АктСписанияЕГАИС.ДокументОснование = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АктПостановкиНаБалансЕГАИС.Ссылка
		|	ИЗ
		|		Документ.АктПостановкиНаБалансЕГАИС КАК АктПостановкиНаБалансЕГАИС
		|	ГДЕ
		|		АктПостановкиНаБалансЕГАИС.ДокументОснование = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПеремещениеВТорговыйЗалЕГАИС.Ссылка
		|	ИЗ
		|		Документ.ПеремещениеВТорговыйЗалЕГАИС КАК ПеремещениеВТорговыйЗалЕГАИС
		|	ГДЕ
		|		ПеремещениеВТорговыйЗалЕГАИС.ДокументОснование = &Ссылка) КАК ВложеннаяТаблица
		|;
		|
		|ВЫБРАТЬ
		|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2 КАК Справка2,
		|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция,
		|	СУММА(ВЫБОР
		|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ОстаткиАлкогольнойПродукцииЕГАИС.Количество
		|		ИНАЧЕ
		|			-ОстаткиАлкогольнойПродукцииЕГАИС.Количество
		|	КОНЕЦ) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаКорректировки
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
		|ГДЕ
		|	ОстаткиАлкогольнойПродукцииЕГАИС.Регистратор В (ВЫБРАТЬ ДокументОснования ИЗ ТаблицаОснований)
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2,
		|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция
		|ИМЕЮЩИЕ
		|	(НЕ СУММА(ВЫБОР
		|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ОстаткиАлкогольнойПродукцииЕГАИС.Количество
		|		ИНАЧЕ
		|			-ОстаткиАлкогольнойПродукцииЕГАИС.Количество
		|	КОНЕЦ) = 0)
		|;
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьТовары.Справка2 КАК Справка2,
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|ПОМЕСТИТЬ
		|	ТабличнаяЧастьТовары
		|ИЗ
		|	&ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|;
		|
		|ВЫБРАТЬ
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2.Справка1 КАК Справка1,
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2 КАК Справка2,
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток+ЕСТЬNULL(ТаблицаКорректировки.Количество, 0) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
		|			"+?(НаДатуДокумента, "&Момент", "")+"," + ?(ГруппаВидаАП = Неопределено, "", "
		|			АлкогольнаяПродукция.ВидПродукции В ИЕРАРХИИ (&ГруппаВидаАП) И ")+"
		|			ОрганизацияЕГАИС = &ОрганизацияЕГАИС" + ?(ИнвентаризацияЕГАИС, " И (НЕ Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка))", "")+") КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТабличнаяЧастьТовары КАК ТабличнаяЧастьТовары
		|ПО
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция И 
		|	ТабличнаяЧастьТовары.Справка2             = ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаКорректировки КАК ТаблицаКорректировки
		|ПО
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.АлкогольнаяПродукция = ТаблицаКорректировки.АлкогольнаяПродукция И 
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2             = ТаблицаКорректировки.Справка2
		|ГДЕ
		|	ТабличнаяЧастьТовары.АлкогольнаяПродукция ЕСТЬ NULL
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТовара = Объект.Товары.Добавить();
			СтрокаТовара.АлкогольнаяПродукция = Выборка.АлкогольнаяПродукция;
			СтрокаТовара.Справка1             = Выборка.Справка1;
			СтрокаТовара.Справка2             = Выборка.Справка2;
			СтрокаТовара.КоличествоКнижн      = Выборка.КоличествоОстаток;
			Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоКнижнПриИзменении(Объект, СтрокаТовара);
			
			СтрокаТовара.ИдентификаторСтроки        = Новый УникальныйИдентификатор;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Обновим служебные реквизиты Алкогольной продукции
	НеОбновлятьДанныеПоАлкоголю = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НеОбновлятьДанныеПоАлкоголю", Ложь);
	
	// Обновим служебные реквизиты Алкогольной продукции
	Если Не НеОбновлятьДанныеПоАлкоголю Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект,Объект.Товары, Объект.Марки);
	КонецЕсли;
	
КонецФункции

Функция ДополнитьИнвентаризациейЕГАИС(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено, НаДатуДокумента = Истина) Экспорт
	Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		ВывестиСообщение(НСтр("ru='Не выбрана организация ЕГАИС.'"));
		Возврат Истина;
	КонецЕсли;
	
	ИнвентаризацииАП = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "ИнвентаризацияАП_ЕГАИС", Неопределено);
	
	Для каждого ИнвентаризацияАП из ИнвентаризацииАП Цикл
		// марки
		Для каждого СтрокаМарки из ИнвентаризацияАП.Марки Цикл
			ИсходныеСтрокиТовара = ИнвентаризацияАП.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки",СтрокаМарки.ИдентификаторСтроки));
			Если ИсходныеСтрокиТовара.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаыеМарки = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки",СтрокаМарки.КодМарки));
			Если НайденнаыеМарки.Количество()>0 Тогда
				ВывестиСообщение(СтрШаблон(НСтр("ru='Марка %1 АП %2 уже есть в документе и добавлена не будет.'"),СтрокаМарки.КодМарки,"["+СокрЛП(ИсходныеСтрокиТовара[0].АлкогольнаяПродукция.Код)+"] "+ИсходныеСтрокиТовара[0].АлкогольнаяПродукция));
				Продолжить;
			КонецЕсли;
			
			СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("АлкогольнаяПродукция,Справка1,Справка2",ИсходныеСтрокиТовара[0].АлкогольнаяПродукция,ИсходныеСтрокиТовара[0].Справка1,ИсходныеСтрокиТовара[0].Справка2));
			Если СтрокиТовара.Количество()=0 Тогда
				СтрокаТовара = Объект.Товары.Добавить();
				СтрокаТовара.АлкогольнаяПродукция = ИсходныеСтрокиТовара[0].АлкогольнаяПродукция;
				Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыАлкогольнаяПродукцияПриИзменении(Объект, СтрокаТовара);
				СтрокаТовара.Справка1 = ИсходныеСтрокиТовара[0].Справка1;
				СтрокаТовара.Справка2 = ИсходныеСтрокиТовара[0].Справка2;
				СтрокаТовара.Номенклатура = ИсходныеСтрокиТовара[0].Номенклатура;
				Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыНоменклатураПриИзменении(Объект, СтрокаТовара);
				СтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				СтрокаТовара.КоличествоФакт = 0;
				Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоФактПриИзменении(Объект, СтрокаТовара);
			Иначе
				СтрокаТовара = СтрокиТовара[0];
			КонецЕсли;
			
			НоваяСтрока = Объект.Марки.Добавить();
			НоваяСтрока.КодМарки = СтрокаМарки.КодМарки;
			НоваяСтрока.ИдентификаторСтроки = СтрокаТовара.ИдентификаторСтроки;
			
			СтрокаТовара.КоличествоФакт = СтрокаТовара.КоличествоФакт + 1;
			Документы.ИнвентаризацияАлкогольнойПродукцииЕГАИС.ТоварыКоличествоФактПриИзменении(Объект, СтрокаТовара);
		КонецЦикла;
	КонецЦикла;
	
	РассчитатьКоличествоКнижное(Объект);
КонецФункции

Процедура ДобавитьМарку(Объект, КодМарки, ПараметрыДействия)
	
	Если ПустаяСтрока(КодМарки) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИнтеграцияЕГАИСВызовСервера.ПроверитьМарку(Объект, КодМарки) Тогда
		Возврат;
	КонецЕсли;
	
	// Код АП
	КодАП = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодАПИзАкцизнойМарки(КодМарки);
	Если КодАП = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Не удалось вычислить код алкогольной продукции для акцизной марки: %1'"),,,,, КодМарки);
		Возврат;
	КонецЕсли;
	
	// Шк акцизной марки
	ИнтеграцияЕГАИС.ДобавитьМаркуИнвентаризация(Неопределено, Объект, КодМарки, КодАП, , , ПараметрыДействия);
	
КонецПроцедуры

Процедура УдалитьМарку(Объект, КодМарки)
	
	СтрокиМарки = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки", КодМарки));
	Если СтрокиМарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаМарки = СтрокиМарки[0];
	
	ИдентификаторСтроки = СтрокаМарки.ИдентификаторСтроки;
	
	Объект.Марки.Удалить(СтрокаМарки);
	
	СтрокиТоваров = Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	Если СтрокиТоваров.Количество()>0 Тогда
		СтрокаТоваров = СтрокиТоваров[0];
		СтрокаТоваров.КоличествоФакт = Макс(СтрокаТоваров.КоличествоФакт - 1, 0);
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьКорректировкиПоДаннымПродажИПоставок(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияЕГАИС) Тогда
		ВывестиСообщение(НСтр("ru='Не выбрана организация ЕГАИС.'"));
		Возврат Истина;
	КонецЕсли;
	
	КонечнаяДата = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "КонечнаяДата", ТекущаяДатаСеанса());
	ГруппаВидаАП = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "ГруппаВидаАП", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента",    Объект.Дата);
	Запрос.УстановитьПараметр("КонечнаяДата",     КонечнаяДата);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", Объект.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ГруппаВидаАП",     ГруппаВидаАП);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОстаткиМарокЕГАИС.КодМарки,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиМарокЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			1
	|		ИНАЧЕ
	|			-1
	|	КОНЕЦ) КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС
	|ГДЕ
	|	ОстаткиМарокЕГАИС.Период > &ДатаДокумента И 
	|	ОстаткиМарокЕГАИС.Период <= &КонечнаяДата И 
	|	ОрганизацияЕГАИС = &ОрганизацияЕГАИС" + ?(ГруппаВидаАП = Неопределено, "", " И 
	|	ОстаткиМарокЕГАИС.Справка2.АлкогольнаяПродукция.ВидПродукции В ИЕРАРХИИ (&ГруппаВидаАП)") + "
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиМарокЕГАИС.КодМарки
	|ИМЕЮЩИЕ
	|	(НЕ СУММА(ВЫБОР
	|		КОГДА ОстаткиМарокЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			1
	|		ИНАЧЕ
	|			-1
	|	КОНЕЦ) = 0)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
		ПараметрыДействия.Вставить("НеОбновлятьДанныеПоАлкоголю", Истина);
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество>0 Тогда
				ДобавитьМарку(Объект, Выборка.КодМарки, ПараметрыДействия);
			Иначе
				УдалитьМарку(Объект, Выборка.КодМарки);
			КонецЕсли;
		КонецЦикла;
		
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект,Объект.Товары, Объект.Марки);
		
		//РассчитатьКоличествоКнижное(Объект, Ложь);
		//ДополнитьКнижнымиЗапасами(Объект, ПараметрыЗаполнения, ПараметрыДействия, Ложь);
		
	КонецЕсли;
	
КонецФункции

#КонецЕсли
